{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋 I'm Chinmayi Sunku. As a driven graduate student at San Jose State University, I am constantly seeking opportunities to expand my knowledge and skills in the technology industry. With a positive and proactive approach, I embrace challenges and am committed to gaining valuable experience. I aspire to secure a fulfilling career as a software engineer or software development engineer, utilizing my expertise to make meaningful contributions to the success of any organization. Thank you 💜",
      "section_name": {
        "about": "About me",
        "workExp": "Work Exp",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "ScanIT©",
        "startDate": "2023",
        "description": "I designed and developed an Android barcode scanning application enriched with price comparison and shopping cart functionalities, revolutionizing the way users effortlessly compare prices across various stores. This app seamlessly integrated data analysis and openAI APIs to offer personalized product recommendations while keeping tabs on user preferences for their favorite stores. To enhance the overall user experience, I also incorporated features that allow users to save their preferred products, craft shopping lists, and jot down notes for future purchases. This dynamic solution was realized through the utilization of Android Studio, Java, FireBase, Rapid APIs, and the openAI API, resulting in a feature-rich and user-centric mobile experience.",
        "images": [
          "images/ScanIT.png"
        ],
        "demo": "https://www.youtube.com/embed/sy4FiPKvGC0?si=26k52dRKLUiycPDH?autoplay=1",
        "url": "https://github.com/chisunku/ScanIT",
        "technologies": [
          {
            "class": "devicon-android-plain",
            "name": "Android Studio"
          },
          {
            "class": "devicon-java-plain",
            "name": "Java"
          },
          {
            "class": "devicon-firebase-plain",
            "name": "firebase"
          },
          {
            "class": "devicon-fastapi-plain",
            "name": "Rapid API"
          },
          {
            "class": "devicon-openal-plain",
            "name": "OpenAI"
          }
        ]
      },
      {
        "title": "SJSU pantry application",
        "startDate": "2022",
        "description": "Developing a web application aimed at providing students at SJSU with convenient access to the communal pantry. With this app, students can easily place orders and reserve time slots for picking up their items, effectively eliminating the need to endure long wait queues. Additionally, this application offers a streamlined solution for volunteers to efficiently manage inventory. To bring this project to life, I'm utilizing technologies such as Spring Boot, ReactJS, and MongoDB, ensuring a user-friendly and efficient system for both students and volunteers.",
        "demo":"https://www.youtube.com/embed/rxEEFNdfvTU?si=RynjSLUPgbCYCfHy",
        "images": [
          "images/pantry.png"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-mongodb-plain",
            "name": "MongoDB"
          },
          {
            "class": "devicon-amazonwebservices-plain",
            "name": "AWS"
          }
        ]
      },
      {
        "title": "Identifying Fake Reviews",
        "startDate": "2015",
        "description": "I embarked on a project aimed at detecting fraudulent product reviews generated by various spamming groups. To combat this issue, I devised a sophisticated model that identifies these spammers and rectifies product ratings by eliminating the counterfeit reviews and ratings. This innovative solution was crafted using a combination of Python, MATLAB, and MySQL, ensuring the accuracy and reliability of the review system while maintaining the integrity of product evaluations.",
        "images": [
          "images/review.png",
          "images/review1.png"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          },
          {
            "class": "devicon-matlab-plain",
            "name": "MATLAB"
          },
          {
            "class": "devicon-mysql-plain",
            "name": "MySql"
          }
        ]
      },
      {
        "title": "FoodGeeks",
        "startDate": "2022",
        "description": "I designed and developed a website that caters to the needs of food enthusiasts by providing them with a platform to share their visually appealing and mouth-watering blogs. The website enables users to search for restaurants based on their preferred cuisine and location, thereby enhancing their culinary experiences. In addition, the website incorporates advanced technology, such as AWS Rekognition and Rapid API, which enables users to extract image tags and find relevant recipes. The website's use of cutting-edge technology and intuitive design enables food lovers to discover new dishes and recipes, and share their culinary experiences with like-minded individuals.",
        "images": [
          "images/review.png",
          "images/review1.png"
        ],
        "demo":"https://www.youtube.com/embed/_dsiVOeylMc?si=WZGxemFIwKDLWrJ3",
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-amazonwebservices-plain-wordmark",
            "name": "AWS"
          },
          {
            "class": "devicon-amazonwebservices-plain-wordmark",
            "name": "AWS Recognition"
          },
          {
            "class": "devicon-amazonwebservices-plain-wordmark",
            "name": "AWS RDS"
          },
          {
            "class": "devicon-sequelize-plain",
            "name": "ElasticSearch"
          },
          {
            "class": "devicon-spring-plain",
            "name": "Sring"
          },
          {
            "class": "devicon-react-original",
            "name": "ReactJS"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Walmart Global Tech",
        "title": "Software Engineering III Intern",
        "years": "May 2023 – Aug 2023",
        "description": "I was able to design and implement a high-performance microservice that helped achieve 80% faster and more scalable push notification delivery. This, in turn, enhanced user experience and engagement. I also implemented WebSockets to reduce message latency, which allowed for efficient and reliable communication. By orchestrating the end-to-end service lifecycle, I was able to increase user engagement by 50% while decreasing email notifications by 30%. As a result, customers were able to seamlessly access and utilize the service, ultimately enhancing their experience.",
        "mainTech": [
          "Full-Stack"
        ],
        "images": [
          "images/Sams-Club-Logo.png",
          "images/walmart-logo-transparent-free-png.png"
        ],
        "technologies_main_disp": [
          "Spring Boot",
          "ReactJS",
          "Apache Kafka",
          "Microsoft Azure",
          "REST API",
          "Microservices",
          "Junit",
          "WebSocket"
        ],
        "technologies": [
          {
            "class": "devicon-spring-plain-wordmark",
            "name": "Spring Boot"
          },
          {
            "class": "devicon-react-original-wordmark",
            "name": "ReactJS"
          },
          {
            "class": "devicon-apachekafka-original-wordmark",
            "name": "Kafka"
          },
          {
            "class": "devicon-azure-plain-wordmark",
            "name": "Microsoft Azure"
          },
          {
            "class": "devicon-figma-plain",
            "name": "Figma"
          }
        ]
      },
      {
        "company": "Cisco Systems",
        "title": "Software Engineer",
        "years": "Aug 2021 – Jul 2022",
        "description": "As a valuable member of the SCM team, I contributed to the enrichment of Snowflake data and the development of business dashboards. I created scripts and queries to improve data accuracy and completeness, resulting in a 20% increase. I also conducted data analysis to identify inefficiencies and optimization opportunities which led to a significant cost reduction of 30% for our clients. I worked closely with the agile team to migrate data from on-premises to the cloud. We reduced downtime by 40%, and ensured data continuity while enhancing system reliability. I also conducted code reviews to maintain a high code quality standard. My proficiency in using Snowflakes, Control-m, Python, shell scripts, and REST APIs was instrumental in ensuring a seamless and efficient migration process. Through my contributions, I helped to identify areas for improvement and guided clients in making informed business decisions.",
        "mainTech": [
          "Software Engineer"
        ],
        "images": [
          "images/cisco-logo-transparent.png"
        ],
        "technologies_main_disp": [
          "Snowflakes",
          "Python",
          "Control-m",
          "shell scripts",
          "API"
        ],
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          }
        ]
      },
      {
        "company": "Cisco Systems",
        "title": "Software Intern",
        "years": "Feb 2021 – Jul 2021",
        "description":"I took the initiative to implement proactive dashboards, ensuring that we could maintain uninterrupted operations by swiftly identifying and resolving system failures. These dashboards have been crucial in ensuring the seamless functioning of our systems. I also optimized infrastructure allocation and managed costs efficiently, resulting in a significant 20% reduction in expenses. This achievement was a testament to my dedication to cost savings and the overall improvement of our operations. Moreover, I facilitated cross-functional collaboration by introducing tools that provided easy access to vital metrics and data. This step greatly improved our decision-making processes and increased cost-efficiency within our organization. To achieve these improvements, I utilized technologies such as SAP HANA and Tableau, which played a pivotal role in our success.",
        "mainTech": [
          "Data Engineer"
        ],
        "images": [
          "images/cisco-logo-transparent.png"
        ],
        "technologies_main_disp": [
          "SAP HANA",
          "Tableau",
          "Vizualization"
        ]
      },
      {
        "company": "MSRIT",
        "title": "Research Intern",
        "years": "Jan 2020 – Mar 2020",
        "description":"I collaborated with my team to conduct research and collectively developed an innovative posture monitoring project, which represented a significant advancement in healthcare technology. I was responsible for processing sensor data, and I utilized ETL (Extract, Transform, Load) techniques to improve the accuracy of patient data. This enhanced accuracy provided healthcare professionals with more reliable information for their decision-making. I took charge of designing and validating a user-friendly Graphical User Interface (GUI). This GUI was instrumental in simplifying the interpretation of data for medical practitioners, making their work more efficient and effective. Throughout this project, I primarily worked with Java-Spring Boot technologies, which played a vital role in the successful implementation of our healthcare technology innovation.",
        "mainTech": [
          "Research"
        ],
        "images": [
          "images/MSRIT.png"
        ],
        "technologies_main_disp": [
          "Java,",
          "Spring Boot"
        ],
        "technologies": [
          {
            "class": "devicon-spring-plain",
            "name": "Spring Boot"
          },
          {
            "class": "devicon-java-plain",
            "name": "Java"
          }
        ]
      }
    ]
  }